OpenFOAM-v1806/tutorials/incompressible/pimpleFoam/LES/surfaceMountedCube/fullCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

method          hierarchical;


hierarchicalCoeffs
{
    n           (8 1 1);
    // delta       0.001;  //< default value = 0.001
    // order       xyz;    //< default order = xyz
}


// ************************************************************************* //
