OpenFOAM-v1806/tutorials/incompressible/pimpleFoam/LES/surfaceMountedCube/fullCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         leastSquares; // Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss DEShybrid
        linear                    // scheme 1
        linearUpwind grad(U)      // scheme 2
        hmax
        0.65                      // DES coefficient, typically = 0.65
        1                         // Reference velocity scale
        1                         // Reference length scale
        0                         // Minimum sigma limit (0-1)
        1                         // Maximum sigma limit (0-1)
        1; // 1.0e-03;                  // Limiter of B function, typically 1e-03
//    div(phi,U)      Gauss LUST grad(U);// linear;
    div(phi,k)      Gauss limitedLinear 0.1;
    div(phi,B)      Gauss limitedLinear 0.1;
    div(B)          Gauss linear;
    div(phi,nuTilda) Gauss limitedLinear 0.1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}


// ************************************************************************* //
